Repository: hmoodaps/work_hourly_with_firebase
Catalog: lib/l10n/intl_*.arb
Languages: ar

# expiredActionCode
source: The OTP link in the email has expired.
ar: رابط OTP في البريد الإلكتروني قد انتهت صلاحيته.

# invalidEmail
source: The email address is invalid.
ar: عنوان البريد الإلكتروني غير صالح.

# userDisabled
source: The user has been disabled.
ar: تم تعطيل المستخدم.

# operationNotAllowed
source: Operation not allowed. Please enable this option in the Firebase Console.
ar: العملية غير مسموح بها. يرجى تمكين هذا الخيار في وحدة تحكم Firebase.

# userMismatch
source: The entered data does not match the user.
ar: البيانات المدخلة لا تتوافق مع المستخدم.

# userNotFound
source: No user found with the provided credentials.
ar: لم يتم العثور على مستخدم مع بيانات الاعتماد المقدمة.

# invalidCredential
source: The entered data is invalid or has expired.
ar: البيانات المدخلة غير صالحة أو انتهت صلاحيتها.

# wrongPassword
source: The password is incorrect or no password was set for the account.
ar: كلمة المرور غير صحيحة أو لا توجد كلمة مرور تم تعيينها للحساب.

# invalidVerificationCode
source: The verification code is invalid.
ar: رمز التحقق غير صالح.

# invalidVerificationId
source: The verification ID is invalid.
ar: معرف التحقق غير صالح.

# accountExistsWithDifferentCredential
source: An account with this email exists but with different credentials.
ar: يوجد حساب بهذا البريد الإلكتروني ولكن مع بيانات اعتماد مختلفة.

# emailAlreadyInUse
source: The email is already in use by another account.
ar: البريد الإلكتروني مستخدم بالفعل من قبل حساب آخر.

# weakPassword
source: The password is too weak.
ar: كلمة المرور ضعيفة جدًا.

# unknownError
source: An unknown error occurred.
ar: حدث خطأ غير معروف.

# success
source: Successfully completed
ar: تم بنجاح

source: Error
ar: خطأ

source: Welcome back!
ar: مرحبًا بعودتك!

source: Email
ar: البريد الإلكتروني

# fieldRequired
source: This field is required
ar: هذا الحقل مطلوب

# signWithGoogle
source: Sign in with Google
ar: تسجيل الدخول باستخدام جوجل

source: or
ar: أو

source: Login
ar: تسجيل الدخول

# forgetPassword
source: Forgot Password
ar: نسيت كلمة المرور

source: Password
ar: كلمة المرور

source: Username
ar: اسم المستخدم

source: Start Work
ar: بدء العمل

source: End Work
ar: إيقاف العمل

source: Workday Date
ar: تاريخ يوم العمل

source: Salary Calculation
ar: حساب الراتب

source: Delete History
ar: حذف التاريخ

source: Reset Password
ar: اعادة تعيين كلمة المرور

# passwordResetSuccess
source: Password reset link sent. Check your inbox.
ar: تم إرسال رابط إعادة تعيين كلمة المرور. تحقق من صندوق البريد

# ltsResetPassword
source: Let’s try resetting your password. We’ll send a link to your email.
ar: دعنا نحاول اعادة تعيين كلمة المرور الخاصة بك. سنقوم بارسال رابط لتعيين كلمة المرور الى البريد الالكتروني الخاص بكم

source: Log Out
ar: تـسجـيل الخـروج

source: Login or Register
ar: التسجيل او تسجيل الدخول

source: Save
ar: حفظ

source: Bonus
ar: مكافأة

source: Discount
ar: خصم

source: Notes:
ar: ملاحظات :

# noteMoney
source: Recorded Amount:
ar: المبلغ المسجل :

source: Your work today:
ar: عملك اليوم :

# noWorkInThisDay
source: No work scheduled for today!
ar: لا توجد أعمال في هذا اليوم!

# startDetail
source: Start Details:
ar: تفاصيل البداية :

# endDetail
source: End Details:
ar: تفاصيل النهاية :

# working
source: Currently working
ar: تعمل حاليًا

# hourlyRateText
source: Hourly Rate:
ar: الأجر بالساعة :

source: Total Hours:
ar: مجموع الساعات :

source: Total Minutes:
ar: مجموع الدقائق :

source: Home
ar: الصفحة الرئيسية

source: History
ar: التــاريـخ

source: Salaries
ar: الـرواتـب

source: Language
ar: الــلـغــة

source: Note Description:
ar: وصف الملاحظة :

source: Cancel
ar: إلغاء

# noData
source: No data available here ^_^
ar: لا يوجد بيانات هنا ^_^

source: Archive
ar: الأرشيف

# itemArchived
source: Item archived successfully!
ar: تم أرشفة العنصر بنجاح!

# itemDeleted
source: Item deleted successfully!
ar: تم حذف العنصر بنجاح!
